[{
		"review_id": "rw1133942",
		"reviewer": "OriginalMovieBuff21",
		"movie": "Kill Bill: Vol. 2 (2004)",
		"rating": "8",
		"review_summary": "Good follow up that answers all the questions",
		"review_date": "24 July 2005",
		"spoiler_tag": 0,
		"review_detail": "After seeing Tarantino's Kill Bill Vol: 1, I got to watch Vol. 2 the next day after seeing it. I liked the first one but didn't really know everything that was going on, but just knowing that she set off the kill 5 individuals who left her dead at her wedding. So I saw Kill Bill: Vol 2 and liked it highly. The movie answered all of my questions to the previous one and had much of a better story and was not unrealistic that much. We finally get to see Bill, who is played by David Carradine who had a really good role in the movie. There is a great conclusion to the movie and had a very good story, along with likable characters, my favorite being Budd. Overall, good movie that answers tons of questions. I recommend Kill Bill Vol. 2.Hedeen's Outlook: 8/10 *** B",
		"helpful": ["0", "1"]
	}, {
		"review_id": "rw1133943",
		"reviewer": "sentra14",
		"movie": "Journey to the Unknown (1968– )",
		"rating": null,
		"review_summary": "Excellent series",
		"review_date": "24 July 2005",
		"spoiler_tag": 0,
		"review_detail": "I have the entire series on video, taped mostly from Sky (Europe) broadcasts. After 35+ years, the show still holds up well. Each show featured an American actor in the lead with British supporting players. Some of my favorite actors in the series included George Maharis, formerly of Route 66, and Barbara Jefford, a British actress. Ms. Jefford played an evil aunt to a boy made to wear dresses and pose as a girl. It would be great if the series would be released on DVD but I'm afraid it's one of the countless short-run series that are very fondly remembered but will never make it to disc. This would be a great series for Encore Mysteries to run.",
		"helpful": ["11", "11"]
	}, {
		"review_id": "rw1133946",
		"reviewer": "GreenwheelFan2002",
		"movie": "The Island (2005)",
		"rating": "9",
		"review_summary": "Not just about action, but about survival...",
		"review_date": "24 July 2005",
		"spoiler_tag": 0,
		"review_detail": "Once again the critics prove themselves as morons! This movie was definitely the best I've seen this summer and deserves a lot more recognition than it is getting. People see the name Michael Bay and instantly think of a sappy action movie not worth the time, but trust me, this one is definitely worth your time and money.I won't comment on specifics of the story because I don't want to spoil it, but as a whole it is very impressive, and tackles many issues that we face in today's society.The acting is great, and Ewan McGregor pulled off his character perfectly. The innocence and wonder that he expresses as Lincoln 6 Echo was the best I've seen from him.I'll admit that the first half of the movie is better than the 2nd half, and the many chase scenes can get frustrating, but the action adds a lot to the movie, and the directing is wonderful.But the one point that this movie tackled which makes it noteworthy is the characterization. I really cared for the two lead characters and wanted to see them succeed in their goal, which is rare in most action films. I even enjoyed seeing the minor characters through the movie, so much that I cared about their outcomes. Not to mention that they are believable. The main character in this film isn't some invulnerable super action hero, he is frail and inexperienced when it comes to fighting. There weren't any moments that I thought he was going out of his capabilities. The characters are confused and weak, and they are depicted wonderfully.Come on people, stop obsessing over the frat comedies, crappy comic-book adaptations, and dumb horror movies, and treat yourself to a good film. Don't pass this one up. GO AND SEE IT NOW!",
		"helpful": ["2", "5"]
	}, {
		"review_id": "rw1133948",
		"reviewer": "itsascreambaby",
		"movie": "Win a Date with Tad Hamilton! (2004)",
		"rating": "3",
		"review_summary": "Falls under the category: seen it a million times before..",
		"review_date": "24 July 2005",
		"spoiler_tag": 0,
		"review_detail": "This IS a film that has been done too many times already: guy's about to confess his true feelings to the love of his life when someone else sweeps her off her feet, but in the end.. Won't give it away but you will more than likely be able to figure it out ten minutes into the movie. The only positive thing about the flick are the actors and actressess giving their characters persona and the character Tad Hamilton, since he's actually not JUST a slimeball one-dimensional character but actually a guy who does transform during the coarse of the movie, just like the other two leads.. Kinda cute but by the looks of it it didn't make it all that well at the box office. Looks cheap. 3/10",
		"helpful": ["2", "3"]
	}]
